In [1]:
import pymysql

In [3]:
%load_ext sql
%sql mysql+pymysql://root:eitapreulasql@127.0.0.1:3306

In [4]:
%%sql
use hr;
select database();

 * mysql+pymysql://root:***@127.0.0.1:3306
0 rows affected.
1 rows affected.

[('hr',)]

In [5]:
%%sql
show tables;

 * mysql+pymysql://root:***@127.0.0.1:3306
5 rows affected.

[('departments',), ('employees',), ('job_history',), ('jobs',), ('locations',)]

Select the names and job start dates of all employees who work for the department number 5.

In [26]:
%%sql
select E.f_name, E.l_name, JH.start_date
from employees E 
inner join job_history JH
    on E.emp_id = JH.empl_id
where E.dep_id = 5;

 * mysql+pymysql://root:***@127.0.0.1:3306
4 rows affected.

[('Alice', 'James', datetime.date(2001, 1, 8)),
 ('Steve', 'Wells', datetime.date(2001, 8, 16)),
 ('Santosh', 'Kumar', datetime.date(2001, 8, 16)),
 ('Ann', 'Jacob', datetime.date(2016, 8, 16))]

Select the names, job start dates, and job titles of all employees who work for the department number 5.

In [25]:
%%sql
select E.f_name, E.l_name, J.job_title 
from employees as E
inner join jobs as J
    on E.job_id = J.job_ident
inner join departments as D
    on E.dep_id = D.dept_id_dep
where D.dept_id_dep = 5;

 * mysql+pymysql://root:***@127.0.0.1:3306
4 rows affected.

[('Alice', 'James', 'Sr.Software Developer'),
 ('Steve', 'Wells', 'Jr.Software Developer'),
 ('Santosh', 'Kumar', 'Jr.Software Developer'),
 ('Ann', 'Jacob', 'Sr. Designer')]

Perform a Left Outer Join on the EMPLOYEES and DEPARTMENT tables and select employee id, last name, department id and department name for
all employees.

In [28]:
%%sql
select E.emp_id, E.l_name, E.dep_id, D.dep_name
from employees as E
left outer join departments as D
    on E.dep_id = D.dept_id_dep;

 * mysql+pymysql://root:***@127.0.0.1:3306
10 rows affected.

[('E1001', 'Thomas', '2', 'Architect Group'),
 ('E1002', 'James', '5', 'Software Group'),
 ('E1003', 'Wells', '5', 'Software Group'),
 ('E1004', 'Kumar', '5', 'Software Group'),
 ('E1005', 'Hussain', '2', 'Architect Group'),
 ('E1006', 'Allen', '2', 'Architect Group'),
 ('E1007', 'Thomas', '7', 'Design Team'),
 ('E1008', 'Gupta', '7', 'Design Team'),
 ('E1009', 'Jones', '7', 'Design Team'),
 ('E1010', 'Jacob', '5', 'Software Group')]

Re-write the previous query but limit the result set to include only the rows for employees born before 1980.

In [40]:
%%sql
select E.emp_id, E.l_name, E.dep_id, D.dep_name
from employees as E
left outer join departments as D
    on E.dep_id = D.dept_id_dep
where year(E.b_date) < 1980;

 * mysql+pymysql://root:***@127.0.0.1:3306
4 rows affected.

[('E1001', 'Thomas', '2', 'Architect Group'),
 ('E1002', 'James', '5', 'Software Group'),
 ('E1006', 'Allen', '2', 'Architect Group'),
 ('E1007', 'Thomas', '7', 'Design Team')]

Re-write the previous query but have the result set include all the employees but department names for only the employees who were born before 1980.

In [46]:
%%sql
select E.emp_id, E.l_name, E.dep_id, D.dep_name
from employees as E
left outer join departments as D
    on E.dep_id = D.dept_id_dep
and year(E.b_date) < 1980;

 * mysql+pymysql://root:***@127.0.0.1:3306
10 rows affected.

[('E1001', 'Thomas', '2', 'Architect Group'),
 ('E1002', 'James', '5', 'Software Group'),
 ('E1003', 'Wells', '5', None),
 ('E1004', 'Kumar', '5', None),
 ('E1005', 'Hussain', '2', None),
 ('E1006', 'Allen', '2', 'Architect Group'),
 ('E1007', 'Thomas', '7', 'Design Team'),
 ('E1008', 'Gupta', '7', None),
 ('E1009', 'Jones', '7', None),
 ('E1010', 'Jacob', '5', None)]

Perform a Full Join on the EMPLOYEES and DEPARTMENT tables and select the First name, Last name and Department name of all employees.

In [50]:
%%sql
select E.f_name, E.l_name, D.dep_name
from employees as E
left outer join departments as D
    on E.dep_id = D.dept_id_dep
union
select E.f_name, E.l_name, D.dep_name
from employees as E
right outer join departments as D
    on E.dep_id = D.dept_id_dep

 * mysql+pymysql://root:***@127.0.0.1:3306
10 rows affected.

[('John', 'Thomas', 'Architect Group'),
 ('Alice', 'James', 'Software Group'),
 ('Steve', 'Wells', 'Software Group'),
 ('Santosh', 'Kumar', 'Software Group'),
 ('Ahmed', 'Hussain', 'Architect Group'),
 ('Nancy', 'Allen', 'Architect Group'),
 ('Mary', 'Thomas', 'Design Team'),
 ('Bharath', 'Gupta', 'Design Team'),
 ('Andrea', 'Jones', 'Design Team'),
 ('Ann', 'Jacob', 'Software Group')]

Re-write the previous query but have the result set include all employee names but department id and department names only for male employees.

In [65]:
%%sql
select E.f_name, E.l_name, D.dept_id_dep, D.dep_name
from employees as E
left outer join departments as D
    on E.dep_id = D.dept_id_dep
    and E.sex = 'M'
union
select E.f_name, E.l_name, D.dept_id_dep, D.dep_name
from employees as E
right outer join departments as D
    on E.dep_id = D.dept_id_dep
    and E.sex = 'M';

 * mysql+pymysql://root:***@127.0.0.1:3306
10 rows affected.

[('John', 'Thomas', '2', 'Architect Group'),
 ('Alice', 'James', None, None),
 ('Steve', 'Wells', '5', 'Software Group'),
 ('Santosh', 'Kumar', '5', 'Software Group'),
 ('Ahmed', 'Hussain', '2', 'Architect Group'),
 ('Nancy', 'Allen', None, None),
 ('Mary', 'Thomas', None, None),
 ('Bharath', 'Gupta', '7', 'Design Team'),
 ('Andrea', 'Jones', None, None),
 ('Ann', 'Jacob', None, None)]